/*
*   什么是包：
*   Node.js中的第三方模块包又叫做包
*   就像电脑和计算机指的是相同的东西，第三方模块和白指的是同一个概念，只不过叫法不同。
*
*
*   包的来源：
*       不同于Node.js中的内置模块与自定义模块，包是由第三方或个人团队开发出来的，免费供所有人使用
*       注意：Node.js中的包都是免费且开源的，不需要付费即可免费下载使用。
*
*   为什么需要包：
*       由于Node.js的内置模块仅提供了一些底层的PI，导致在基于内置模块进行项目开发时，效率很低。
*       包是基于内置模块封装出来的，提供了更改及，更方便的API，极大的提高了开发效率。
*       包和内置模块之间的关系，类似于jQuery和浏览器内置API之间的关系
*
*   从哪里进行下载：
*       包搜索平台https://www.npmjs.com/
*       包共享平台https://registry.npmjs.org/
*
*   如何下载包：
*       npm。inc公司提供了一个包管理工具，我们可以使用这个包管理工具，从https://registry.npmjs.org/服务器上把需要的包下载到本地使用
*       这个包管理工具的名字叫做Node Package Manage(简称npm包管理工具)，这个包管理工具随着Node.js的安装包一起安装到了自己的电脑上。
*
*
* */